---
kind: method
id: M:Autodesk.Revit.DB.CurveArray.Append(Autodesk.Revit.DB.Curve)
source: html/8a9eabb9-9d6a-9c11-e4d2-c5a7d7f49168.htm
---
# Autodesk.Revit.DB.CurveArray.Append Method

Add the curve to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	Curve item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Curve`) - The curve to be added.